#### Day 9: Advanced Joins üöÄ

Welcome to Day 9! Today, we‚Äôll dive deeper into the world of SQL joins, exploring advanced join techniques to handle more complex data relationships.

#### 1. Database Connection

In [12]:
import mysql.connector
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="30_Days_SQL"
)
cursor = conn.cursor()
print("Connected to '30_Days_SQL'!")

Connected to '30_Days_SQL'!

---
#### 1. Self Join ‚úçÔ∏è
A self join is a join where a table is joined with itself. This is useful for hierarchical data like employee-manager relationships.

In [13]:
query = """
SELECT e1.name AS employee, e2.name AS manager
FROM employees e1
LEFT JOIN employees e2
ON e1.manager_id = e2.employee_id;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_2896\1850639316.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

    employee    manager
0       Alan       None
1      Brian       Alan
2  Catherine       Alan
3      Dylan      Brian
4       Evan  Catherine
5      Helen  Catherine

#### 2. Cross Join üå±
A cross join returns the Cartesian product of two tables.

In [14]:
cursor.execute("DROP TABLE IF EXISTS colors")
cursor.execute("CREATE TABLE colors (color_id INT PRIMARY KEY, color_name VARCHAR(50))")

cursor.executemany("INSERT INTO colors VALUES (%s, %s)", [(1, 'Red'), (2, 'Blue')])
conn.commit()

query = """
SELECT p.product_name, c.color_name
FROM products p
CROSS JOIN colors c;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_2896\4171135578.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

   product_name color_name
0        Laptop        Red
1        Laptop       Blue
2         Mouse        Red
3         Mouse       Blue
4      Keyboard        Red
5      Keyboard       Blue
6         Chair        Red
7         Chair       Blue
8          Desk        Red
9          Desk       Blue
10         Book        Red
11         Book       Blue

#### 3. Using Joins with Aggregates üèä
Calculating total sales by customer using JOIN and GROUP BY.

In [15]:
query = """
SELECT c.customer_name, SUM(o.order_total) AS total_sales
FROM customers c
JOIN orders o
ON c.customer_id = o.customer_id
GROUP BY c.customer_name;
"""
pd.read_sql(query, conn)

C:\Users\lenovo\AppData\Local\Temp\ipykernel_2896\1163821734.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

  customer_name  total_sales
0          John       5200.0
1         Sarah       3500.0

In [16]:
conn.close()